from logic.board import Board

#  TODO Класс Point

# TODO разбить файл на классы по принципу один класс - один файл

#TODO При выборе фигуры в интерфейсе поднимать флажок. Когда он поднят, можно выбрать любое второе поле. Если всё ок - ход сделан.
# Иначе флажок опускать и фигуры как бы не выбрана, всё по новой
"""
Класс ChessFigure используется как заготовка
для всех остальных классов фигур.
"""

# TODO Сделать механику превращения пешки, взятия на проходе и рокировки + мат и пат + шах


class Player:
    def __int__(self, color):
        self.color = color

    def smth(self):
        pass


